OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f031x4.h
#define CORDIC_CR_START_MODE_Pos                (9U)
#define CORDIC_CR_START_MODE_Msk                (0x1UL << CORDIC_CR_START_MODE_Pos)
#define CORDIC_CR_START_MODE                    CORDIC_CR_START_MODE_Msk

#define CORDIC_CR_VECSIZE_Pos                   (20U)
#define CORDIC_CR_VECSIZE_Msk                   (0x1UL << CORDIC_CR_VECSIZE_Pos)
#define CORDIC_CR_VECSIZE                       CORDIC_CR_VECSIZE_Msk

#define CORDIC_CR_RESSIZE_Pos                   (21U)
#define CORDIC_CR_RESSIZE_Msk                   (0x1UL << CORDIC_CR_RESSIZE_Pos)
#define CORDIC_CR_RESSIZE                       CORDIC_CR_RESSIZE_Msk

#define CORDIC_CR_ARGSIZE_Pos                   (22U)
#define CORDIC_CR_ARGSIZE_Msk                   (0x1UL << CORDIC_CR_ARGSIZE_Pos)
#define CORDIC_CR_ARGSIZE                       CORDIC_CR_ARGSIZE_Msk

#define CORDIC_CR_CORDIC_INT_MASK_Pos           (28U)
#define CORDIC_CR_CORDIC_INT_MASK_Msk           (0x1UL << CORDIC_CR_CORDIC_INT_MASK_Pos)
#define CORDIC_CR_CORDIC_INT_MASK               CORDIC_CR_CORDIC_INT_MASK_Msk

#define CORDIC_CR_SQRT_INT_MASK_Pos             (29U)
#define CORDIC_CR_SQRT_INT_MASK_Msk             (0x1UL << CORDIC_CR_SQRT_INT_MASK_Pos)
#define CORDIC_CR_SQRT_INT_MASK                 CORDIC_CR_SQRT_INT_MASK_Msk

#define CORDIC_CR_CORDIC_ERROR_INT_MASK_Pos     (30U)
#define CORDIC_CR_CORDIC_ERROR_INT_MASK_Msk     (0x1UL << CORDIC_CR_CORDIC_ERROR_INT_MASK_Pos)
#define CORDIC_CR_CORDIC_ERROR_INT_MASK         CORDIC_CR_CORDIC_ERROR_INT_MASK_Msk

#define CORDIC_CR_ARCTAN_MOD_OV_MASK_Pos        (31U)
#define CORDIC_CR_ARCTAN_MOD_OV_MASK_Msk        (0x1UL << CORDIC_CR_ARCTAN_MOD_OV_MASK_Pos)
#define CORDIC_CR_ARCTAN_MOD_OV_MASK            CORDIC_CR_ARCTAN_MOD_OV_MASK_Msk



/*******************  Bit definition for CORDIC_THETA register  *********************/
#define CORDIC_THETA_THETA_Pos        (0U)
#define CORDIC_THETA_THETA_Msk        (0xFFFFFFFFUL << CORDIC_THETA_THETA_Pos)  /*!< 0xFFFFFFFF */
#define CORDIC_THETA_THETA            CORDIC_THETA_THETA_Msk                    /*!< Cordic SIN/COS input theta register bits */

/*******************  Bit definition for CORDIC_SIN register  ***************  ******/
#define CORDIC_SIN_SIN_Pos            (0U)
#define CORDIC_SIN_SIN_Msk            (0xFFFFFFFFUL << CORDIC_SIN_SIN_Pos)      /*!< 0xFFFFFFFF */
#define CORDIC_SIN_SIN                CORDIC_SIN_SIN_Msk                        /*!< Cordic SIN result register bits */

/*******************  Bit definition for CORDIC_COS register  ***************  ******/
#define CORDIC_COS_COS_Pos            (0U)
#define CORDIC_COS_COS_Msk            (0xFFFFFFFFUL << CORDIC_COS_COS_Pos)      /*!< 0xFFFFFFFF */
#define CORDIC_COS_COS                CORDIC_COS_COS_Msk                        /*!< Cordic COS result register bits */

/*******************  Bit definition for CORDIC_X register  *****************  ****/
#define CORDIC_X_X_Pos                (0U)
#define CORDIC_X_X_Msk                (0xFFFFFFFFUL << CORDIC_X_X_Pos)          /*!< 0xFFFF0000 */
#define CORDIC_X_X                    CORDIC_X_X_Msk                            /*!< Cordic arctan/modult X register bits */

/*******************  Bit definition for CORDIC_Y register  *****************  ****/
#define CORDIC_Y_Y_Pos                (0U)
#define CORDIC_Y_Y_Msk                (0xFFFFFFFFUL << CORDIC_Y_Y_Pos)         /*!< 0xFFFFFFFF */
#define CORDIC_Y_Y                    CORDIC_Y_Y_Msk                           /*!< Cordic arctan/modult Y register bits */

/*******************  Bit definition for CORDIC_MOD register  ***************  ******/
#define CORDIC_MOD_MOD_Pos            (0U)
#define CORDIC_MOD_MOD_Msk            (0xFFFFFFFFUL << CORDIC_MOD_MOD_Pos)     /*!< 0xFFFFFFFF */
#define CORDIC_MOD_MOD                CORDIC_MOD_MOD_Msk                       /*!< Cordic artan sqrt result register bits */

/*******************  Bit definition for CORDIC_ARCTAN register  *********************/
#define CORDIC_ARCTAN_ARCTAN_Pos      (0U)
#define CORDIC_ARCTAN_ARCTAN_Msk      (0xFFFFFFFFUL << CORDIC_ARCTAN_ARCTAN_Pos) /*!< 0xFFFFFFFF */
#define CORDIC_ARCTAN_ARCTAN          CORDIC_ARCTAN_ARCTAN_Msk                   /*!< Cordic arctan theta register bits */

/*******************  Bit definition for DSP_RAD register  *********************/
#define CORDIC_DSP_RAD_RAD_Pos        (0U)
#define CORDIC_DSP_RAD_RAD_Msk        (0xFFFFFFFFUL << CORDIC_DSP_RAD_RAD_Pos)   /*!< 0xFFFFFFFF */
#define CORDIC_DSP_RAD_RAD            CORDIC_DSP_RAD_RAD_Msk                     /*!< Cordic RAD register bits */

/*******************  Bit definition for DSP_SQRT register  *********************/
#define CORDIC_DSP_SQRT_SQRT_Pos      (0U)
#define CORDIC_DSP_SQRT_SQRT_Msk      (0xFFFFUL << CORDIC_DSP_SQRT_SQRT_Pos)     /*!< 0x0000FFFF */
#define CORDIC_DSP_SQRT_SQRT          CORDIC_DSP_SQRT_SQRT_Msk                   /*!< Cordic sqrt register bits */

/*******************  Bit definition for CORDIC_SR register  *********************/
#define CORDIC_SR_CCFF_Pos            (0U)
#define CORDIC_SR_CCFF_Msk            (0x1UL << CORDIC_SR_CCFF_Pos)          /*!< 0x00000001 */
#define CORDIC_SR_CCFF                CORDIC_SR_CCFF_Msk                     /*!< Cordic result interrupt generate flag */

#define CORDIC_SR_SCFF_Pos            (1U)
#define CORDIC_SR_SCFF_Msk            (0x1UL << CORDIC_SR_SCFF_Pos)
#define CORDIC_SR_SCFF                CORDIC_SR_SCFF_Msk

#define CORDIC_SR_CCEF_Pos            (2U)
#define CORDIC_SR_CCEF_Msk            (0x1UL << CORDIC_SR_CCEF_Pos)
#define CORDIC_SR_CCEF                CORDIC_SR_CCEF_Msk

#define CORDIC_SR_ACEF_Pos            (3U)
#define CORDIC_SR_ACEF_Msk            (0x1UL << CORDIC_SR_ACEF_Pos)
#define CORDIC_SR_ACEF                CORDIC_SR_ACEF_Msk

#define CORDIC_SR_BSY_Pos             (4U)
#define CORDIC_SR_BSY_Msk             (0x1UL << CORDIC_SR_BSY_Pos)
#define CORDIC_SR_BSY                 CORDIC_SR_BSY_Msk

/******************************************************************************/
/*                                                                            */
/*                           Hardware Divider(HDIV)                           */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for HDIV_DEND register  ********************/
#define HDIV_DEND_DEND_Pos              (0U)
#define HDIV_DEND_DEND_Msk              (0xFFFFFFFFUL << HDIV_DEND_DEND_Pos)     /*!< 0xFFFFFFFF */
#define HDIV_DEND_DEND                  HDIV_DEND_DEND_Msk

/*******************  Bit definition for HDIV_SOR register  *********************/
#define HDIV_SOR_SOR_Pos                (0U)
#define HDIV_SOR_SOR_Msk                (0xFFFFFFFFUL << HDIV_SOR_SOR_Pos)       /*!< 0xFFFFFFFF */
#define HDIV_SOR_SOR                    HDIV_SOR_SOR_Msk

/*******************  Bit definition for HDIV_QUOT register  ********************/
#define HDIV_QUOT_QUOT_Pos              (0U)
#define HDIV_QUOT_QUOT_Msk              (0xFFFFFFFFUL << HDIV_QUOT_QUOT_Pos)     /*!< 0xFFFFFFFF */
#define HDIV_QUOT_QUOT                  HDIV_QUOT_QUOT_Msk

/*******************  Bit definition for HDIV_REMD register  ********************/
#define HDIV_REMD_REMD_Pos              (0U)
#define HDIV_REMD_REMD_Msk              (0xFFFFFFFFUL << HDIV_REMD_REMD_Pos)     /*!< 0xFFFFFFFF */
#define HDIV_REMD_REMD                  HDIV_REMD_REMD_Msk

/*******************  Bit definition for HDIV_SIGN register  ********************/
#define HDIV_SIGN_SIGN_Pos              (0U)
#define HDIV_SIGN_SIGN_Msk              (0x1UL << HDIV_SIGN_SIGN_Pos)            /*!< 0x00000001 */
#define HDIV_SIGN_SIGN                  HDIV_SIGN_SIGN_Msk

/*******************  Bit definition for HDIV_STAT register  ********************/
#define HDIV_STAT_END_Pos               (0U)
#define HDIV_STAT_END_Msk               (0x1UL << HDIV_STAT_END_Pos)            /*!< 0x00000001 */
#define HDIV_STAT_END                   HDIV_STAT_END_Msk
#define HDIV_STAT_ZERO_Pos              (1U)
#define HDIV_STAT_ZERO_Msk              (0x1UL << HDIV_STAT_ZERO_Pos)           /*!< 0x00000002 */
#define HDIV_STAT_ZERO                  HDIV_STAT_ZERO_Msk

/******************************************************************************/
/*                                                                            */
/*      Universal Synchronous Asynchronous Receiver Transmitter (USART)       */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for USART_SR register  *******************/
#define USART_SR_PE_Pos                     (0U)
#define USART_SR_PE_Msk                     (0x1UL << USART_SR_PE_Pos)          /*!< 0x00000001 */
#define USART_SR_PE                         USART_SR_PE_Msk                     /*!< Parity Error */
#define USART_SR_FE_Pos                     (1U)
#define USART_SR_FE_Msk                     (0x1UL << USART_SR_FE_Pos)          /*!< 0x00000002 */
#define USART_SR_FE                         USART_SR_FE_Msk                     /*!< Framing Error */
#define USART_SR_NE_Pos                     (2U)
#define USART_SR_NE_Msk                     (0x1UL << USART_SR_NE_Pos)          /*!< 0x00000004 */
#define USART_SR_NE                         USART_SR_NE_Msk                     /*!< Noise Error Flag */
#define USART_SR_ORE_Pos                    (3U)
#define USART_SR_ORE_Msk                    (0x1UL << USART_SR_ORE_Pos)         /*!< 0x00000008 */
#define USART_SR_ORE                        USART_SR_ORE_Msk                    /*!< OverRun Error */
#define USART_SR_IDLE_Pos                   (4U)
#define USART_SR_IDLE_Msk                   (0x1UL << USART_SR_IDLE_Pos)        /*!< 0x00000010 */
#define USART_SR_IDLE                       USART_SR_IDLE_Msk                   /*!< IDLE line detected */
#define USART_SR_RXNE_Pos                   (5U)
#define USART_SR_RXNE_Msk                   (0x1UL << USART_SR_RXNE_Pos)        /*!< 0x00000020 */
#define USART_SR_RXNE                       USART_SR_RXNE_Msk                   /*!< Read Data Register Not Empty */
#define USART_SR_TC_Pos                     (6U)
#define USART_SR_TC_Msk                     (0x1UL << USART_SR_TC_Pos)          /*!< 0x00000040 */
#define USART_SR_TC                         USART_SR_TC_Msk                     /*!< Transmission Complete */
#define USART_SR_TXE_Pos                    (7U)
#define USART_SR_TXE_Msk                    (0x1UL << USART_SR_TXE_Pos)         /*!< 0x00000080 */
#define USART_SR_TXE                        USART_SR_TXE_Msk                    /*!< Transmit Data Register Empty */
#define USART_SR_LBD_Pos                    (8U)
#define USART_SR_LBD_Msk                    (0x1UL << USART_SR_LBD_Pos)         /*!< 0x00000080 */
#define USART_SR_LBD                        USART_SR_LBD_Msk                    /*!< LIN break detected */
#define USART_SR_CTS_Pos                    (9U)
#define USART_SR_CTS_Msk                    (0x1UL << USART_SR_CTS_Pos)         /*!< 0x00000200 */
#define USART_SR_CTS                        USART_SR_CTS_Msk                    /*!< CTS Flag */
#define USART_SR_ABRF_Pos                   (10U)
#define USART_SR_ABRF_Msk                   (0x1UL << USART_SR_ABRF_Pos)        /*!< 0x00000400 */
#define USART_SR_ABRF                       USART_SR_ABRF_Msk                   /*!< Auto brr detection Flag */
#define USART_SR_ABRE_Pos                   (11U)
#define USART_SR_ABRE_Msk                   (0x1UL << USART_SR_ABRE_Pos)        /*!< 0x00000800 */
#define USART_SR_ABRE                       USART_SR_ABRE_Msk                   /*!< Auto brr detection err Flag */
#define USART_SR_ABRRQ_Pos                  (12U)
#define USART_SR_ABRRQ_Msk                  (0x1UL << USART_SR_ABRRQ_Pos)       /*!< 0x00001000 */
#define USART_SR_ABRRQ                      USART_SR_ABRRQ_Msk                  /*!< Auto brr detection request */

/*******************  Bit definition for USART_DR register  *******************/
#define USART_DR_DR_Pos                     (0U)
#define USART_DR_DR_Msk                     (0x1FFUL << USART_DR_DR_Pos)        /*!< 0x000001FF */
#define USART_DR_DR                         USART_DR_DR_Msk                     /*!< Data value */

